#### ❌ Terraform Plan (Dev Environment)

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.iam.google_project_iam_member.app_error_writer will be created
  + resource "google_project_iam_member" "app_error_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "dev-ai-agents-projects"
      + role    = "roles/errorreporting.writer"
    }

  # module.iam.google_project_iam_member.app_log_writer will be created
  + resource "google_project_iam_member" "app_log_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "dev-ai-agents-projects"
      + role    = "roles/logging.logWriter"
    }

  # module.iam.google_project_iam_member.app_metric_writer will be created
  + resource "google_project_iam_member" "app_metric_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "dev-ai-agents-projects"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.iam.google_project_iam_member.app_secret_accessor will be created
  + resource "google_project_iam_member" "app_secret_accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "dev-ai-agents-projects"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.iam.google_project_iam_member.app_trace_agent will be created
  + resource "google_project_iam_member" "app_trace_agent" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "dev-ai-agents-projects"
      + role    = "roles/cloudtrace.agent"
    }

  # module.iam.google_service_account.app will be created
  + resource "google_service_account" "app" {
      + account_id   = "financia-app-dev"
      + description  = "Service account for Financia Cloud Run service in dev"
      + disabled     = false
      + display_name = "Financia Application Service Account (dev)"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "dev-ai-agents-projects"
      + unique_id    = (known after apply)
    }

  # module.secret_manager.google_secret_manager_secret.secrets["GEMINI_API_KEY_DEV"] will be created
  + resource "google_secret_manager_secret" "secrets" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "app"         = "financia"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "app"         = "financia"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + name                  = (known after apply)
      + project               = "dev-ai-agents-projects"
      + secret_id             = "GEMINI_API_KEY_DEV"
      + terraform_labels      = {
          + "app"         = "financia"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.secret_manager.google_secret_manager_secret.secrets["GOOGLE_CLIENT_ID_DEV"] will be created
  + resource "google_secret_manager_secret" "secrets" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "app"         = "financia"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "app"         = "financia"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + name                  = (known after apply)
      + project               = "dev-ai-agents-projects"
      + secret_id             = "GOOGLE_CLIENT_ID_DEV"
      + terraform_labels      = {
          + "app"         = "financia"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.secret_manager.google_secret_manager_secret.secrets["GOOGLE_CLIENT_SECRET_DEV"] will be created
  + resource "google_secret_manager_secret" "secrets" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "app"         = "financia"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "app"         = "financia"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + name                  = (known after apply)
      + project               = "dev-ai-agents-projects"
      + secret_id             = "GOOGLE_CLIENT_SECRET_DEV"
      + terraform_labels      = {
          + "app"         = "financia"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.secret_manager.google_secret_manager_secret.secrets["GOOGLE_REFRESH_TOKEN_DEV"] will be created
  + resource "google_secret_manager_secret" "secrets" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "app"         = "financia"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "app"         = "financia"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + name                  = (known after apply)
      + project               = "dev-ai-agents-projects"
      + secret_id             = "GOOGLE_REFRESH_TOKEN_DEV"
      + terraform_labels      = {
          + "app"         = "financia"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.secret_manager.google_secret_manager_secret.secrets["WHATSAPP_API_KEY_DEV"] will be created
  + resource "google_secret_manager_secret" "secrets" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "app"         = "financia"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "app"         = "financia"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + name                  = (known after apply)
      + project               = "dev-ai-agents-projects"
      + secret_id             = "WHATSAPP_API_KEY_DEV"
      + terraform_labels      = {
          + "app"         = "financia"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.secret_manager.google_secret_manager_secret_iam_member.app_access["GEMINI_API_KEY_DEV"] will be created
  + resource "google_secret_manager_secret_iam_member" "app_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = "dev-ai-agents-projects"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.secret_manager.google_secret_manager_secret_iam_member.app_access["GOOGLE_CLIENT_ID_DEV"] will be created
  + resource "google_secret_manager_secret_iam_member" "app_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = "dev-ai-agents-projects"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.secret_manager.google_secret_manager_secret_iam_member.app_access["GOOGLE_CLIENT_SECRET_DEV"] will be created
  + resource "google_secret_manager_secret_iam_member" "app_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = "dev-ai-agents-projects"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.secret_manager.google_secret_manager_secret_iam_member.app_access["GOOGLE_REFRESH_TOKEN_DEV"] will be created
  + resource "google_secret_manager_secret_iam_member" "app_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = "dev-ai-agents-projects"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.secret_manager.google_secret_manager_secret_iam_member.app_access["WHATSAPP_API_KEY_DEV"] will be created
  + resource "google_secret_manager_secret_iam_member" "app_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = "dev-ai-agents-projects"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.secret_manager.google_secret_manager_secret_version.secret_versions["GEMINI_API_KEY_DEV"] will be created
  + resource "google_secret_manager_secret_version" "secret_versions" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = (known after apply)
      + secret_data           = (sensitive value)
      + version               = (known after apply)
    }

  # module.secret_manager.google_secret_manager_secret_version.secret_versions["GOOGLE_CLIENT_ID_DEV"] will be created
  + resource "google_secret_manager_secret_version" "secret_versions" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = (known after apply)
      + version               = (known after apply)
    }

  # module.secret_manager.google_secret_manager_secret_version.secret_versions["GOOGLE_CLIENT_SECRET_DEV"] will be created
  + resource "google_secret_manager_secret_version" "secret_versions" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = (known after apply)
      + version               = (known after apply)
    }

  # module.secret_manager.google_secret_manager_secret_version.secret_versions["GOOGLE_REFRESH_TOKEN_DEV"] will be created
  + resource "google_secret_manager_secret_version" "secret_versions" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = (known after apply)
      + version               = (known after apply)
    }

  # module.secret_manager.google_secret_manager_secret_version.secret_versions["WHATSAPP_API_KEY_DEV"] will be created
  + resource "google_secret_manager_secret_version" "secret_versions" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = (known after apply)
      + secret_data           = (sensitive value)
      + version               = (known after apply)
    }

Plan: 21 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + environment           = "dev"
  + secret_ids            = (sensitive value)
  + service_account_email = (known after apply)

```

</details>

**Status:** Failed (exit code: 1)
